Projeto_Desafio/app/controllers/items_controller.rb

SELECT "items".* FROM "items" WHERE (purchaser_name LIKE '%R$30 of awesome %')
---
  def index
    @items = Item.all

INSERT INTO "items" ("purchaser_name", "item_description", "item_price", "purchase_count", "merchant_address", "merchant_name", "arquivo", "created_at", "updated_at", "gross_income") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create

    @response = ImportarService.call item_params[:arquivo]

    unless @response
        flash[:notice] = "Extensão inválida"
    else
        flash[:notice] = "Dados importados com sucesso"
    end

    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save