Projeto_Desafio/app/controllers/items_controller.rb

    def get_filtered_items
      #@items = Item.all
      @items = Item.where(user_id: current_user.id)
      return if params[:q].nil?
      params[:q].each do |k,v|
        @items = @items.where("#{k} LIKE ?", "%#{v}%")
---
SELECT "items".* FROM "items" WHERE "items"."user_id" = $1  [["user_id", 1]]