Projeto_Desafio/app/controllers/items_controller.rb

SELECT "items".* FROM "items" LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "items" WHERE (:purchaser_name LIKE '%João%')
---
  def index
    @items = Item.paginate(page: params[:page], per_page: 5)