Projeto_Desafio/app/services/importar_service.rb

INSERT INTO "items" ("purchaser_name", "item_description", "item_price", "purchase_count", "merchant_address", "merchant_name", "arquivo", "gross_income", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
    def salvar_no_banco arquivo

        open("#{Rails.root}/uploads/#{arquivo}") do |file|
            file.each_with_index do |linha, i|
                next if i == 0
                coluna = linha.split("\t")
                item = Item.new
                item.purchaser_name = coluna[0]
                item.item_description = coluna[1]
                item.item_price = coluna[2].to_f
                item.purchase_count = coluna[3].to_f
                item.merchant_address = coluna[4]
                item.merchant_name = coluna[5]
                item.gross_income = coluna[6].to_f
                item.user_id = @current_user_id
                item[:gross_income] += (item.purchase_count * item.item_price)

                self.import_errors.push([i, item.errors.full_messages]) unless item.save